In [52]:
%matplotlib inline
import pandas as pd

In [53]:
titles = pd.DataFrame.from_csv('data/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [55]:
cast = pd.DataFrame.from_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

230621

In [9]:
len(titles)

230621

### What are the earliest two films listed in the titles dataframe?

In [10]:
titles.sort_values('year').head(2)

                     title  year
176477          Miss Jerry  1894
213694  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [20]:
len(titles[titles.title == "Hamlet"])

20

### How many movies are titled "North by Northwest"?

In [21]:
len(titles[titles.title == "North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [24]:
titles[titles.title == "Hamlet"].sort_values('year').head(1)

        title  year
34225  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
titles[titles.title == "Treasure Island"].sort_values('year')

                  title  year
204540  Treasure Island  1918
50896   Treasure Island  1920
189691  Treasure Island  1934
96259   Treasure Island  1950
59186   Treasure Island  1972
110576  Treasure Island  1973
203909  Treasure Island  1985
178072  Treasure Island  1999

### How many movies were made in the year 1950?

In [20]:
len(titles[titles.year == 1950])

1093

### How many movies were made in the year 1960?

In [21]:
len(titles[titles.year == 1960])

1496

### How many movies were made from 1950 through 1959?

In [15]:
len(titles[(titles.year >= 1950) & (titles.year <=1959)])

12656

### In what years has a movie titled "Batman" been released?

In [24]:
titles[titles.title == "Batman"].sort_values('year')

        title  year
74047  Batman  1943
55577  Batman  1989

### How many roles were there in the movie "Inception"?

In [56]:
len(cast[cast.title == "Inception"])

77

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [57]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.isnull()]
len(c)

26

0

### But how many roles in the movie "Inception" did receive an "n" value?

In [58]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.notnull()]
len(c)

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [61]:
c = cast
c = c[c.title == 'North by Northwest']
c = c[c.n.notnull()].sort_values('n')
len(c)

16

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [66]:
c = cast
c = c[(c.title == 'Sleuth')&(c.year == 1972)]
c = c.sort_values('n')
c

,title,year,name,type,character,n
1644328,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
314691,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
360365,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1412647,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2619278,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1396572,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [65]:
c = cast
c = c[(c.title == 'Sleuth')&(c.year == 2007)]
c = c.sort_values('n')
c

          title  year                 name     type          character    n
314692   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1246855  Sleuth  2007             Jude Law    actor               Milo  2.0
1741124  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
250297   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
360366   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2619277  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3223502  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [67]:
c = cast
c = c[(c.title == 'Hamlet') & (c.year == 1921)]
len(c)

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many roles were credited in Branagh’s 1996 Hamlet?

In [70]:
c = cast
c = c[c.title == "Hamlet"]
c = c[c.year == 1996]
len(c)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [71]:
c = cast
c = c[c.character == "Hamlet"]
len(c)

91

### How many people have played an "Ophelia"?

In [75]:
c = cast
c = c[c.character == "Ophelia"]
len(c)

111

In [77]:
len(cast[cast.character == "Ophelia"].name.unique())

109

### How many people have played a role called "The Dude"?

In [78]:
len(cast[cast.character == "The Dude"].name.unique())

18

In [79]:
c = cast
c = c[c.character == "The Dude"]
len(c)

18

### How many people have played a role called "The Stranger"?

In [80]:
c = cast
c = c[c.character == "The Stranger"]
len(c)

208

### How many roles has Sidney Poitier played throughout his career?

In [82]:
c = cast
c = c[c.name == "Sidney Poitier"]
len(c)

43

In [81]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many roles has Judi Dench played?

In [83]:
c = cast
c = c[c.name == "Judi Dench"]
len(c)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [85]:
c = cast
c = c[c.name == "Cary Grant"]
c = c[(c.year >= 1940)&(c.year <=1949)]
c = c[c.n == 2].sort_values('year')
c

                   title  year        name   type    character    n
840371  My Favorite Wife  1940  Cary Grant  actor         Nick  2.0
840381    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [86]:
c = cast
c = c[c.name == 'Cary Grant']
c = c[c.year // 10 == 194]
c = c[c.n == 1 ]
c = c.sort_values('year')
c

,title,year,name,type,character,n
840397,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
840353,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
840399,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
840386,Suspicion,1941,Cary Grant,actor,Johnnie,1.0
840401,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
840377,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
840344,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
840369,Mr. Lucky,1943,Cary Grant,actor,Joe Adams,1.0
840370,Mr. Lucky,1943,Cary Grant,actor,Joe Bascopolous,1.0
840378,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
840336,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
840373,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
840372,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
840375,Notorious,1946,Cary Grant,actor,Devlin,1.0
840393,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
840394,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
840368,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
840348,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
840357,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [87]:
c = cast
c = c[c.year // 10 == 195]
c = c[c.type == 'actor']
len(c)

154727

### How many roles were available for actresses in the 1950s?

In [88]:
c = cast
c = c[c.year // 10 == 195]
c = c[c.type == 'actress']
len(c)

56259

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [89]:
c = cast
c = c[c.n == 1]
c = c[c.year <= 1980]
len(c)

84264

### How many non-leading roles were available through from the beginning of film history through 1980?

In [90]:
c = cast
c = c[c.n != 1]
c = c[c.year <= 1980]
len(c)

1094780

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [91]:
c = cast
c = c[c.n.isnull()]
c = c[c.year <= 1980]
len(c)

438086